code/openfoam/test/Lagrangian/VoF/constant/Lagrangian/LagrangianModels
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  dev
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "constant/Lagrangian";
    object      LagrangianModels;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

injection
{
    type        manualInjection;
    positions   (($x 0 0.4)) [m];
}

gravity
{
    type        gravity;
}

drag
{
    type        SchillerNaumannDrag;
}

// ************************************************************************* //
